In [2]:
import pandas as pd # pd 로 불러옴

In [3]:
df = pd.read_csv(r"C:\Users\skytr\Documents\GitHub\do-it-python\04\popSeoul.csv", thousands=',') #인코딩 안될 때 'cp949', 'utf8'
# csv 로 불러오는 방법, 경로 복사 붙여넣고,  r, 천에 콤마가 있는 경우

In [7]:
 df.mean()

C:\Users\skytr\AppData\Local\Temp\ipykernel_21224\768187483.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

Korean       389615.92
Foreigner     11421.16
Senior        58725.84
dtype: float64

In [8]:
# df = 데이터프레임: 판다스에서 사용하도록 최적화된 데이터프레임
df.sum() #서울시 구별 인구

Gu           JongroguJongruYongsanguSeongdongguKwangjinguDo...
Korean                                                 9740398
Foreigner                                               285529
Senior                                                 1468146
dtype: object

In [20]:
df40 = df[df['Korean']  > 400000] #새로운 판다스 객체

In [23]:
df40.mean() #평균

C:\Users\skytr\AppData\Local\Temp\ipykernel_21224\720381563.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df40.mean() #평균

Korean       499974.545455
Foreigner      9410.636364
Senior        71570.818182
dtype: float64

In [27]:
df40.describe() #40만 넘는 구

              Korean     Foreigner        Senior
count      11.000000     11.000000     11.000000
mean   499974.545455   9410.636364  71570.818182
std     82297.154215   8973.573427   9926.428852
min    406748.000000   4082.000000  56455.000000
25%    436308.500000   4399.500000  63331.000000
50%    481663.000000   5015.000000  70204.000000
75%    539655.000000   9686.500000  79962.500000
max    677489.000000  33102.000000  86062.000000

In [28]:
df.describe() #서울시

              Korean     Foreigner        Senior
count      25.000000     25.000000     25.000000
mean   389615.920000  11421.160000  58725.840000
std    129798.481698   8432.515366  16360.578539
min    126409.000000   2314.000000  23025.000000
25%    314090.000000   4547.000000  51708.000000
50%    397618.000000  10254.000000  59808.000000
75%    459849.000000  15645.000000  70029.000000
max    677489.000000  34076.000000  86062.000000

In [31]:
df = pd.read_csv(r"C:\Users\skytr\Documents\GitHub\do-it-python\05\apt201302.csv", encoding = 'cp949')
# encoding = 'cp949'(특정 프로그램에서 저장할 때 저장한 코딩방법) , 'utf8'

In [32]:
df.head()

,시군구,구,동,단지명,전용면적(㎡),계약년월,단가,계약일,가격,층,건축년도,도로명,해제사유발생일,거래유형,중개사소재지
0,서울특별시,강남구,압구정동,"현대6차(78~81,83,84,86,87동)",157.000,202302,3694.267516,14,580000,4,1978,압구정로 201,NaN,중개거래,서울 강남구
1,서울특별시,서초구,반포동,반포자이,194.515,202302,2724.725600,28,530000,17,2009,신반포로 270,NaN,중개거래,서울 서초구
2,서울특별시,강남구,압구정동,"현대7차(73~77,82,85동)",157.360,202302,3171.072700,4,499000,11,1979,압구정로 201,NaN,중개거래,서울 강남구
3,서울특별시,용산구,한남동,트윈빌에이동,222.690,202302,2020.746329,20,450000,5,2008,유엔빌리지길 11,NaN,직거래,-
4,서울특별시,서초구,반포동,반포주공1단지,104.890,202302,4099.532844,17,430000,5,1973,신반포로 9,NaN,중개거래,서울 서초구

In [35]:
import numpy as np
a  = np.array([[170, 180, 190, 175]])
a.mean()

178.75

In [36]:
# 명목자료는 셀 수만 있다. 빈도분석 
df['구'].value_counts()

송파구     236
강동구     200
노원구     176
강남구     163
강서구     148
성북구     144
양천구     114
동대문구    102
도봉구     101
영등포구     98
구로구      95
서대문구     91
은평구      91
마포구      87
성동구      84
서초구      67
동작구      61
중랑구      53
광진구      46
관악구      46
강북구      36
금천구      31
중구       29
종로구      21
용산구      19
Name: 구, dtype: int64

In [44]:
df.groupby('단지명')['가격'].mean()[50:100]

단지명
강남역우정에쉐르           21000.000000
강동리버스트4단지          74350.000000
강동역신동아파밀리에         99500.000000
강동역에스케이허브          71500.000000
강동큐브(2차)           11000.000000
강변                 54500.000000
강변그대가리버뷰          130000.000000
강변래미안              87000.000000
강변힐스테이트            98500.000000
강서뉴타워              70000.000000
강서힐스테이트           112460.000000
강오(A동)             50000.000000
강일리버파크3단지          72000.000000
강일리버파크5단지          78200.000000
강일리버파크7단지          59000.000000
강일리버파크8단지          78750.000000
강일리버파크9단지          85000.000000
개나리래미안            325000.000000
개포래미안포레스트         169000.000000
개포우성1             255000.000000
개포우성2             247000.000000
개포주공5단지           199000.000000
개포주공6단지           250000.000000
개화산경남아너스빌          57500.000000
갤러리아팰리스           340000.000000
갤럭시더정릉             19025.000000
거상장미               32000.000000
거성푸르뫼2             41000.000000
거성학마을아파트           45000.000000
거여1단지              59666.666667
거여5단지              72000.000000
건영2차               54500.000000
건영2차아파트            71400.000000
건영3                91000.000000
경남                 85750.000000
경남2                43000.000000
경남2차              220000.000000
경남교수               85000.000000
경남아너스빌             64000.000000
경남아너스빌(1356-0)     62375.000000
경동엠파이어스테이트          8200.000000
경동윈츠리버             77000.000000
경희궁롯데캐슬           117000.000000
경희궁자이(2단지)        160875.000000
경희궁자이(3단지)        141000.000000
경희궁파크팰리스          185000.000000
고덕 아이파크           135000.000000
고덕그라시움            127033.333333
고덕롯데캐슬베네루체         98625.000000
고덕리엔파크2단지          73500.000000
Name: 가격, dtype: float64

안녕하세요. 오늘은 numpy와 pandas에 대해서 알아보려고 합니다.